## Q1. List any five functions of the pandas library with execution.

In [1]:
import pandas as pd
df = pd.read_csv('subset-covid-data.csv') #Used to read data from a CSV file into a DataFrame.

In [2]:
df.head() #Print First 5 rows

,country,continent,date,day,month,year,cases,deaths,country_code,population
0,Afghanistan,Asia,2020-04-12,12,4,2020,34,3,AFG,37172386.0
1,Albania,Europe,2020-04-12,12,4,2020,17,0,ALB,2866376.0
2,Algeria,Africa,2020-04-12,12,4,2020,64,19,DZA,42228429.0
3,Andorra,Europe,2020-04-12,12,4,2020,21,2,AND,77006.0
4,Angola,Africa,2020-04-12,12,4,2020,0,0,AGO,30809762.0

In [4]:
df.info() ##Displays information about the DataFrame, including data types and non-null counts

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206 entries, 0 to 205
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   country       206 non-null    object
 1   continent     206 non-null    object
 2   date          206 non-null    object
 3   day           206 non-null    int64
 4   month         206 non-null    int64
 5   year          206 non-null    int64
 6   cases         206 non-null    int64
 7   deaths        206 non-null    int64
 8   country_code  202 non-null    object
 9   population    202 non-null    float64
dtypes: float64(1), int64(5), object(4)
memory usage: 16.2+ KB

In [3]:
df.describe() #summary statistics of the DataFrame's numeric columns

              day       month    year         cases       deaths    population
count  206.000000  206.000000   206.0    206.000000   206.000000  2.020000e+02
mean    12.024272    3.985437  2020.0    395.247573    29.713592  3.731716e+07
std      0.424141    0.209020     0.0   2160.176439   159.533131  1.413776e+08
min     11.000000    1.000000  2020.0      0.000000     0.000000  1.000000e+03
25%     12.000000    4.000000  2020.0      0.000000     0.000000  1.278222e+06
50%     12.000000    4.000000  2020.0     11.500000     0.000000  7.042862e+06
75%     12.000000    4.000000  2020.0     88.750000     3.000000  2.600084e+07
max     18.000000    4.000000  2020.0  28391.000000  1831.000000  1.392730e+09

In [6]:
df.isna().sum() # Check null values in data frame

country         0
continent       0
date            0
day             0
month           0
year            0
cases           0
deaths          0
country_code    4
population      4
dtype: int64

In [9]:
df.corr() #check the correlation in dataframe

C:\Users\udhayaus\AppData\Local\Temp\ipykernel_9520\3514509782.py:1: FutureWarning: The default value of numeric_only in DataFrame.corr is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.corr()

                 day     month  year     cases    deaths  population
day         1.000000 -0.986416   NaN -0.034746 -0.054326   -0.019167
month      -0.986416  1.000000   NaN  0.012810  0.013040    0.018663
year             NaN       NaN   NaN       NaN       NaN         NaN
cases      -0.034746  0.012810   NaN  1.000000  0.943220    0.175539
deaths     -0.054326  0.013040   NaN  0.943220  1.000000    0.145211
population -0.019167  0.018663   NaN  0.175539  0.145211    1.000000

## Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [41]:
data = {'A':[1,2,3,4,5,6,8],'B':[23,12,45,56,66,33,45],'C':[34,45,65,23,12,56,34]}
df = pd.DataFrame(data)
df

   A   B   C
0  1  23  34
1  2  12  45
2  3  45  65
3  4  56  23
4  5  66  12
5  6  33  56
6  8  45  34

In [43]:
index = [list(range(1,14,2))]
df.set_index(index)

    A   B   C
1   1  23  34
3   2  12  45
5   3  45  65
7   4  56  23
9   5  66  12
11  6  33  56
13  8  45  34

## Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.   For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should calculate and print the sum of the first three values, which is 60.

In [5]:
import pandas as pd

data = {'Values': [10, 20, 30, 40, 50]}
df1 = pd.DataFrame(data)
def three_columns(df):
    value = 0
    for i,j in df1.iterrows():
        if i < 3: 
            value += j[0]
    return print("Sum of First Three values:",value)    
values1 = three_columns(df1)
values1

Sum of First Three values: 60

## Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [6]:
data = {'Text':["Python","Data Science","Deep learning","Natural Language Processing"]}
df = pd.DataFrame(data)
def Word_counter(df):
    df['Word_Count'] = [len(i.split()) for i in df['Text']]
    return df
Word_counter(df)

                          Text  Word_Count
0                       Python           1
1                 Data Science           2
2                Deep learning           2
3  Natural Language Processing           3

## Q5. How are DataFrame.size() and DataFrame.shape() different?

In [7]:
print("Size of DataFrame :",df1.size)
print("Dimention of DataFrame(rows,Columns):",df1.shape)

Size of DataFrame : 5
Dimention of DataFrame(rows,Columns): (5, 1)

## Q6 :Which function of pandas do we use to read an excel file?

To read an Excel file in pandas, you can use the read_excel() function. This function allows you to read data from an Excel file and create a DataFrame.

Here's the basic syntax of the read_excel() function:

In [9]:
import pandas as pd
# Read Excel file and create DataFrame
df = pd.read_excel('file.xlsx')

In the code above, replace 'file.xlsx' with the actual path of your Excel file. By default, read_excel() reads the first sheet of the Excel file, but you can also specify the sheet name or sheet index using the sheet_name parameter.

In [96]:
# Read a specific sheet from the Excel file
df = pd.read_excel('file.xlsx', sheet_name='Sheet1')

You can also read specific columns, skip rows, and perform various other configurations using additional parameters provided by the read_excel() function.

## Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column'Username' in df that contains only the username part of each email address.

## The username is the part of the email address that appears before the '@' symbol. For example, if theemail address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your function should extract the username from each email address and store it in the new 'Username'

In [16]:
df1 = pd.DataFrame({'Email':["udhayavijay@gmail.com",'vijaykumar@gmail.com','santhoshkumar@gmail.com']})
 
def extract_username(df):
    df['Username'] = [i.split('@')[0] for i in df['Email']] 
    return df
extract_username(df1)

                     Email       Username
0    udhayavijay@gmail.com    udhayavijay
1     vijaykumar@gmail.com     vijaykumar
2  santhoshkumar@gmail.com  santhoshkumar

## Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.

In [11]:
data1 = {'A':[3,8,6,2,9],
        'B':[5,2,9,3,1],
        'C':[1,7,4,5,2]}
df = pd.DataFrame(data1)
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [14]:
def filter_data(df):
    fd = df[(df.A > 5) & (df.B < 10)]
    return fd
fd1 = filter_data(df) 
fd1

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

## Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [17]:
def calculate_statistics(df):
    mean_value = df['Values'].mean()
    median_value = df['Values'].median()
    std_deviation = df['Values'].std()
    return mean_value, median_value, std_deviation

data = {'Values': [10, 20, 30, 40, 50]}
df = pd.DataFrame(data)
mean, median, std = calculate_statistics(df)
print("Mean:", mean)
print("Median:", median)
print("Standard Deviation:", std)

Mean: 30.0
Median: 30.0
Standard Deviation: 15.811388300841896

In [18]:
import pandas as pd

def calculate_moving_average(df):
    df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()
    return df

data = {'Date': pd.date_range(start='2023-07-01', periods=20),
        'Sales': [10, 15, 20, 25, 30, 35, 40, 45, 50, 55, 60, 65, 70, 75, 80, 85, 90, 95, 100, 105]}
df = pd.DataFrame(data)
df_with_moving_avg = calculate_moving_average(df)
print(df_with_moving_avg)

         Date  Sales  MovingAverage
0  2023-07-01     10           10.0
1  2023-07-02     15           12.5
2  2023-07-03     20           15.0
3  2023-07-04     25           17.5
4  2023-07-05     30           20.0
5  2023-07-06     35           22.5
6  2023-07-07     40           25.0
7  2023-07-08     45           30.0
8  2023-07-09     50           35.0
9  2023-07-10     55           40.0
10 2023-07-11     60           45.0
11 2023-07-12     65           50.0
12 2023-07-13     70           55.0
13 2023-07-14     75           60.0
14 2023-07-15     80           65.0
15 2023-07-16     85           70.0
16 2023-07-17     90           75.0
17 2023-07-18     95           80.0
18 2023-07-19    100           85.0
19 2023-07-20    105           90.0

In [25]:
import pandas as pd
data = {'Date': pd.date_range(start='2023-01-01', periods=5)}
df = pd.DataFrame(data)

In [30]:
def Week_days(df):
    df['week_days'] = df.Date.dt.day_name()
    return df
Week_days(df)

        Date  week_days
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

## Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [33]:
import pandas as pd
data = {'Date': pd.date_range(start='2023-01-01', periods=31)}
df1 = pd.DataFrame(data)

In [35]:
def timestamps(df):
    data = df['Date'].timestamp()
    return data

In [36]:
import pandas as pd

def select_january_dates(df):
    start_date = '2023-01-01'
    end_date = '2023-01-31'
    selected_rows = df[(df['Date'] >= start_date) & (df['Date'] <= end_date)]
    return selected_rows
data = {'Date': pd.date_range(start='2023-01-01', periods=31)}
df = pd.DataFrame(data)
selected_january_dates = select_january_dates(df)
print(selected_january_dates)

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06
6  2023-01-07
7  2023-01-08
8  2023-01-09
9  2023-01-10
10 2023-01-11
11 2023-01-12
12 2023-01-13
13 2023-01-14
14 2023-01-15
15 2023-01-16
16 2023-01-17
17 2023-01-18
18 2023-01-19
19 2023-01-20
20 2023-01-21
21 2023-01-22
22 2023-01-23
23 2023-01-24
24 2023-01-25
25 2023-01-26
26 2023-01-27
27 2023-01-28
28 2023-01-29
29 2023-01-30
30 2023-01-31

## Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

To use the basic functions of pandas, the first and foremost necessary library that needs to be imported is the pandas library itself. The pandas library provides the fundamental data structures (DataFrame and Series) and a wide range of functions for data manipulation, analysis, and cleaning.

In [37]:
import pandas as pd